docs/thesis/final_presentation/IMRD/real_mode.org
* Introduction
  - ctrl-Z -> fg cycle method
    現状の機能ではctrl-Cで保存しているので，実際の開発とは使用者の入力に誤差が生まれている．
* Method
  - sequential_checkの通常モードに加えて，一時保存から再開の開発の流れを実現する機能の導入（real）．
  - 方法
    1. $ ruby_learner -s -r でモード切り替え
    2. $ ruby_learner -s 1 2で作業用emacsを展開
       この時に一時保存ctrl+zと再開fgをしてもらう．
    3. $ ruby_learner -s -c で作業用emacs内のコードをrspecとrubocopでチェックする．

* Result and Discussion
  - realモードは現実の開発環境にさらに近づける一歩とするつもりだったがイマイチの出来となった．それは自動化を行うこと自体が本当の開発から離れたコマンドの入力を促してしまうからだった．また，実際の開発ではrspecのチェックの他に何度も自らのコードを実行してその振る舞いを確認している．これに関してもまったく実現できていない．本機能は完全に通常の機能の劣化版と考える．

要改善．(-> not_all_auto.org)
