docs/thesis/final_presentation/IMRD/real_mode.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>real_mode</title>
<!-- 2018-12-06 木 14:05 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Takaki Otsu" />
</head>
<body>
<div id="content">
<h1 class="title">real_mode</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Introduction</a></li>
<li><a href="#sec-2">2. Method</a></li>
<li><a href="#sec-3">3. Result and Discussion</a></li>
</ul>
</div>
</div>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>ctrl-Z -&gt; fg cycle method
現状の機能ではctrl-Cで保存しているので，実際の開発とは使用者の入力に誤差が生まれている．
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Method</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>sequential<sub>checkの通常モードに加えて，一時保存から再開の開発の流れを実現する機能の導入（real）．</sub>
</li>
<li>方法
<ol class="org-ol">
<li>$ ruby<sub>learner</sub> -s -r でモード切り替え
</li>
<li>$ ruby<sub>learner</sub> -s 1 2で作業用emacsを展開
この時に一時保存と再開をしてもらう．
</li>
<li>$ ruby<sub>learner</sub> -s -c で作業用emacs内のコードをrspecとrubocopでチェックする．
</li>
</ol>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Result and Discussion</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li>realモードは現実の開発環境にさらに近づける一歩とするつもりだったがイマイチの出来となった．それは自動化を行うこと自体が本当の開発から離れたコマンドの入力を促してしまうからだった．また，実際の開発ではrspecのチェックの他に何度も自らのコードを実行してその振る舞いを確認している．これに関してもまったく実現できていない．本機能は完全に通常の機能の劣化版と考える．
</li>
</ul>

<p>
要改善．(-&gt; not<sub>all</sub><sub>auto</sub>.org)
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Takaki Otsu</p>
<p class="date">Created: 2018-12-06 木 14:05</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.3.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
